# ARİTMETİK İŞLEMLER

In [1]:
import pandas as pd
import numpy as np

In [3]:
s1=pd.Series(np.arange(4),index=["a","c","d","e"])
s2=pd.Series(np.arange(5),index=["a","c","e","f","g"])

In [4]:
s1

a    0
c    1
d    2
e    3
dtype: int32

In [5]:
s2

a    0
c    1
e    2
f    3
g    4
dtype: int32

In [6]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [8]:
df1=pd.DataFrame(np.arange(6).reshape(2,3),columns=list("ABC"),
                index=["John","Pearl"])
df2=pd.DataFrame(np.arange(9).reshape(3,3),columns=list("ACD"),
                index=["John","Micheal","Pearl"])

In [9]:
df1

       A  B  C
John   0  1  2
Pearl  3  4  5

In [10]:
df2

         A  C  D
John     0  1  2
Micheal  3  4  5
Pearl    6  7  8

In [11]:
df1+df2

           A   B     C   D
John     0.0 NaN   3.0 NaN
Micheal  NaN NaN   NaN NaN
Pearl    9.0 NaN  12.0 NaN

df1 in add methodunu kullanarak df2 ile eşleşmeyen değerlere sıfır atlayarak toplama yapmak istersek;

In [13]:
df1.add(df2,fill_value=0)

           A    B     C    D
John     0.0  1.0   3.0  2.0
Micheal  3.0  NaN   4.0  5.0
Pearl    9.0  4.0  12.0  8.0

In [14]:
1/df1

              A     B    C
John        inf  1.00  0.5
Pearl  0.333333  0.25  0.2

In [15]:
df1*3

       A   B   C
John   0   3   6
Pearl  9  12  15

In [19]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: Micheal, dtype: int32

In [20]:
df2-s

         A  C  D
John    -3 -3 -3
Micheal  0  0  0
Pearl    3  3  3

In [21]:
s2=df2["A"]
s2

John       0
Micheal    3
Pearl      6
Name: A, dtype: int32

In [22]:
df2.sub(s2,axis="index")

         A  C  D
John     0  1  2
Micheal  0  1  2
Pearl    0  1  2

# FONKSİYON UYGULAMAK

In [23]:
vs=pd.DataFrame(np.random.randn(4,3),columns=list("ABC"),
               index=["John","Pearl","Dennis","Sally"])
vs

               A         B         C
John    1.359228 -2.272084 -0.390759
Pearl  -1.432797  0.209257 -1.290982
Dennis -0.464903 -0.496829  0.114584
Sally   0.760281  0.302620 -0.420921

abs fonksiyonu ile mutlak değer uyguladık.

In [25]:
np.abs(vs)

               A         B         C
John    1.359228  2.272084  0.390759
Pearl   1.432797  0.209257  1.290982
Dennis  0.464903  0.496829  0.114584
Sally   0.760281  0.302620  0.420921

In [26]:
f=lambda x:x.max()-x.min()

Fonksiyon uygulamak için apply methodu kullanırız.

In [31]:
vs.apply(f)

               A         B         C
John    1.847499  5.162366  0.152693
Pearl   2.052907  0.043789  1.666635
Dennis  0.216134  0.246839  0.013129
Sally   0.578027  0.091579  0.177174

In [32]:
vs.apply(f,axis=1)

               A         B         C
John    1.847499  5.162366  0.152693
Pearl   2.052907  0.043789  1.666635
Dennis  0.216134  0.246839  0.013129
Sally   0.578027  0.091579  0.177174

In [33]:
def f(x):
    return x**2

In [30]:
vs.apply(f)

               A         B         C
John    1.847499  5.162366  0.152693
Pearl   2.052907  0.043789  1.666635
Dennis  0.216134  0.246839  0.013129
Sally   0.578027  0.091579  0.177174